index.org
#+TITLE: Mujic: Learning Music Theory With Clojure
#+AUTHOR: Bo Jeanes
#+EMAIL: me@bjeanes.com
#+STARTUP: showeverything
#+OPTIONS: toc:nil ^:{} creator:nil email:nil date:nil num:nil
#+PROPERTY: header-args:clojure :session *clj* :cache yes :results value silent :tangle "src/mujic.cljc"
#+HTML_HEAD_EXTRA: <link rel="stylesheet" href="app.css" type="text/css" />
#+HTML_HEAD_EXTRA: <script src="mujic.js"></script>

#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: html-scripts:nil html-style:nil html5-fancy:nil tex:nil
#+HTML_DOCTYPE: html5
#+HTML_CONTAINER: div

#+BEGIN_SRC emacs-lisp :exports none :results silent
#+END_SRC

#+BEGIN_SRC clojure :exports none
  (ns mujic
    (:require [clojure.set :as set]
              [clojure.string :as str]
              #?(:cljs [reagent.core
                        :as r
                        :refer [render]]))
    #?@(:cljs [(:require-macros [mujic :refer [defintervals]])
               (:refer-clojure :exclude [atom])]))

  #?(:cljs
     (do (enable-console-print!)
         (def ratom r/atom))

     :clj
     (do
       (defmacro render [& args])
       (def ratom atom)))

  (declare note-series)

  ;; Some global state to keep all the interactive components using the same key
  ;; or tonic
  (def tonic (ratom :C))
  (def key tonic)

  (defn- get-selected-key [event]
    (-> event
        .-target
        .-selectedOptions
        (aget 0)
        .-value
        keyword))

  (defn- key-selector-on-change [event]
    (reset! key (get-selected-key event)))

  (defn key-selector-component
    "Render a re-usable widget that selects the key or tonic for the interactive example.
     Adjusts the key for the entire page (i.e. global state)."
    []
    (letfn [(option-fn [note] [:option {:value note} (name note)])]
      (let [notes (take 12 (note-series :C))
            notes (map first notes) ; TODO handle C#/Db distinctions better
            options (map option-fn notes)]
        [:div {:style {:text-align "center"}}
         (into [:select {:value @key
                         :style {:padding "auto"}
                         :on-change key-selector-on-change}]
               options)])))
#+END_SRC

* Preamble

I've played guitar since I was about 7 years old. Like many casual musicians, my
interest and focus has waxed and waned over those years and, consequently, my
skill level plateaued sometime before I was 18. Every time that I've been
inspired to play a lot more, it lasts only as long as it takes for me to hit
that same plateau threshold; that is, my frustration understanding how music
really worked diminishes ([[https://en.wikipedia.org/wiki/Diminished_triad][rimshot]]) my interest.

The feeling of really grokking music theory has always eluded me. Every time
that I have tried to learn some music theory, it just felt like a house of cards
built on memorising labels and rules, each with an abundance of special cases
and exceptions. Every bit of theory I managed to learn in the past would slip
away just as quickly because the foundation wasn't sturdy.

Since I've been really missing working with Clojure, I decided to try to learn
music theory by using Clojure to explore the relationships between different
concepts (notes, intervals, scales, modes, chords). Approaching music theory as
if it were any other unknown domain that I had to model in code should help me
really understand and formalise how things work and hopefully let it stick in my
head.

This post serves as my logbook and worksheet for the experiment. As such, it
preserves any understandings which are incorrect or incomplete and subsequent
re-understandings of concepts are appended. I will retroactively edit earlier
sections to make them clearer or easier to refer to later, though.

