index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-09-21 Mon 20:35 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Mujic: Learning Music Theory With Clojure</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Bo Jeanes">
</head>
<body>
<div id="content">
<h1 class="title">Mujic: Learning Music Theory With Clojure</h1>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Preamble</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
I've played guitar since I was about 7 years old. Like many casual musicians, my
interest and focus has waxed and waned over those years and, consequently, my
skill level plateaued sometime before I was 18. Every time that I've been
inspired to play a lot more, it lasts only as long as it takes for me to hit
that same plateau threshold; that is, my frustration understanding how music
really worked diminishes (<a href="https://en.wikipedia.org/wiki/Diminished_triad">rimshot</a>) my interest.
</p>

<p>
The feeling of really grokking music theory has always eluded me. Every time
that I have tried to learn some music theory, it just felt like a house of cards
built on memorising labels and rules, each with an abundance of special cases
and exceptions. Every bit of theory I managed to learn in the past would slip
away just as quickly because the foundation wasn't sturdy.
</p>

<p>
Since I've been really missing working with Clojure, I decided to try to learn
music theory by using Clojure to explore the relationships between different
concepts (notes, intervals, scales, modes, chords). Approaching music theory as
if it were any other unknown domain that I had to model in code should help me
really understand and formalise how things work and hopefully let it stick in my
head.
</p>

<p>
This post serves as my logbook and worksheet for the experiment. As such, it
preserves any understandings which are incorrect or incomplete and subsequent
re-understandings of concepts are appended. I will retroactively edit earlier
sections to make them clearer or easier to refer to later, though.
</p>
</div>
</div>
