index.org
* Future

- generate chord charts dynamically by applying notes to the fretboard
  with constraints (how wide can a hand stretch, how many fingers exist, which
  strings can be muted, etc)

  #+BEGIN_SRC clojure
    ;; a 24-fret guitar fretboard of notes
    (def guitar
      (map (comp (partial take 24) note-series)
           [:E :A :D :G :B :E]))
  #+END_SRC

- interactive visualisations (circle of fifths)
- representing chords

  - as intervals as applied to all known scales
  - as absolute intervals (e.g. dim is R m3 d5 - i.e. intervals from root)
  - as relative intervals (e.g. dim is R m3 m3 --- i.e. intervals between component tones)

- representing scales

  - as semitone/tone
  - as intervals from root

- "diff" a chord (e.g. diff minor to Major? "♭3")
- "diff" a scale
- generate modal melodies based on a sequence of chords
- interface with Java or JS (if ClojureScript) MIDI/sound libraries to
  hear intervals and chords
- interval/chord ear training
- typing tutor style exercise that asks for intervals and listens to an
  instrument pluck the relative interval. Goal here is to learn the
  positions of intervals on the fretboard, I think.
- Edit this to an executable "literate Clojure" file so snippets are
  executable and remain correct.

  - or a Gorilla REPL worksheet! Especially if the "plot" renderings are pluggable!

- Whatever feels like fun!

#+BEGIN_SRC clojure :exports none
  #?(:cljs
     ;; For every function defined in current namespace which ends in
     ;; `-component`, wire it up as a Reagent component to a DOM element of the
     ;; same ID.
     ;;
     ;; Must be at end of file because ns-interns is a macro
     (.addEventListener
      js/document
      "DOMContentLoaded"
      (fn []
        (let [intern-kv (ns-interns 'mujic)
              component-keys (filter (comp (partial re-find #"-component$")
                                        name)
                                     (keys intern-kv))]
          (doseq [k component-keys
                  :let [f @(k intern-kv)
                        e (.getElementById js/document
                                           (name k))]]
            (when e
              (render [f] e)))))))
#+END_SRC
