index.html

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Future</h2>
<div class="outline-text-2" id="text-orgheadline3">
<ul class="org-ul">
<li><p>
generate chord charts dynamically by applying notes to the fretboard
with constraints (how wide can a hand stretch, how many fingers exist, which
strings can be muted, etc)
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span class="org-comment-delimiter">;; </span><span class="org-comment">a 24-fret guitar fretboard of notes</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">def</span> <span class="org-variable-name">guitar</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>map <span class="org-rainbow-delimiters-depth-3">(</span>comp <span class="org-rainbow-delimiters-depth-4">(</span>partial take <span class="org-highlight-numbers-number">24</span><span class="org-rainbow-delimiters-depth-4">)</span> note-series<span class="org-rainbow-delimiters-depth-3">)</span>
       <span class="org-rainbow-delimiters-depth-3">[</span><span class="org-clojure-keyword">:E</span> <span class="org-clojure-keyword">:A</span> <span class="org-clojure-keyword">:D</span> <span class="org-clojure-keyword">:G</span> <span class="org-clojure-keyword">:B</span> <span class="org-clojure-keyword">:E</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div></li>

<li>interactive visualisations (circle of fifths)</li>
<li>representing chords

<ul class="org-ul">
<li>as intervals as applied to all known scales</li>
<li>as absolute intervals (e.g. dim is R m3 d5 - i.e. intervals from root)</li>
<li>as relative intervals (e.g. dim is R m3 m3 &#x2014; i.e. intervals between component tones)</li>
</ul></li>

<li>representing scales

<ul class="org-ul">
<li>as semitone/tone</li>
<li>as intervals from root</li>
</ul></li>

<li>"diff" a chord (e.g. diff minor to Major? "♭3")</li>
<li>"diff" a scale</li>
<li>generate modal melodies based on a sequence of chords</li>
<li>interface with Java or JS (if ClojureScript) MIDI/sound libraries to
hear intervals and chords</li>
<li>interval/chord ear training</li>
<li>typing tutor style exercise that asks for intervals and listens to an
instrument pluck the relative interval. Goal here is to learn the
positions of intervals on the fretboard, I think.</li>
<li>Edit this to an executable "literate Clojure" file so snippets are
executable and remain correct.

<ul class="org-ul">
<li>or a Gorilla REPL worksheet! Especially if the "plot" renderings are pluggable!</li>
</ul></li>

<li>Whatever feels like fun!</li>
</ul>
</div>
</div>
</div>
</body>
</html>
